_posts/2015-11-28-Orgmode-Run-Code.html
---
layout: post
title: 在org mode文件运行代码
tag: [Emacs]
description: [Run code in org mode]
---

<p>
(持续更新)
</p>

<p>
orgmode 的一个强大的功能就是可以在文件里运行代码, 例如下面的代码,
直接在代码出按 C-c C-c, 就会在代码下面显示运行结果, 结果开头用#+RESULTS修饰.
</p>

<p>
#+NAME test
</p>
<div class="org-src-container">

<pre class="src src-elisp">(+ 1 1)
(message "hllo world")
</pre>
</div>

<p>
下面是<a href="http://orgmode.org/manual/Working-with-source-code.html#Working-with-source-code">官方网站</a> 关于在orgmode里插入代码的文档, 这个功能是 Eric Schulte 和 Dan Davison
贡献的, 曾经叫做org babel.
</p>
<blockquote>
<p>
This functionality was contributed by Eric Schulte and Dan Davison, and was originally named Org-babel.
</p>
</blockquote>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">代码模块格式</h2>
<div class="outline-text-2" id="text-1">
<p>
在orgmode中插入的代码格式为:
</p>
<pre class="example">
"#+NAME: &lt;name&gt;
"#+BEGIN_SRC &lt;language&gt; &lt;switches&gt; &lt;header arguments&gt;
&lt;body&gt;
"#+END_SRC
</pre>
<p>
"#+NAME"这一行是可选的, 这个主要用于给代码块命名. 
"switches"和"header arguments"也是可选的,
</p>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">代码编辑</h2>
<div class="outline-text-2" id="text-2">
<p>
使用 C-c '快捷键编辑当前代码. 这会打开一个包含代码段的"该语言模式"的缓冲区进行
编辑, 编辑完成继续按 C-c ' 保存, 也可以 <b>C-c C-k</b> 退出.
</p>
</div>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">代码运行</h2>
<div class="outline-text-2" id="text-3">
<p>
除了像示例那样直接在代码出按C-c C-c运行代码外, 还可以在任何位置
调用 #+CALL: &lt;函数名&gt; ([参数])的方式调用函数. 
</p>
</div>
</div>
